; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	satellite2 - satellite
	instrument5 - instrument
	instrument6 - instrument
	instrument7 - instrument
	satellite3 - satellite
	instrument8 - instrument
	satellite4 - satellite
	instrument9 - instrument
	instrument10 - instrument
	instrument11 - instrument
	satellite5 - satellite
	instrument12 - instrument
	instrument13 - instrument
	satellite6 - satellite
	instrument14 - instrument
	instrument15 - instrument
	instrument16 - instrument
	infrared3 - mode
	spectrograph2 - mode
	thermograph0 - mode
	infrared4 - mode
	image1 - mode
	GroundStation3 - direction
	GroundStation1 - direction
	GroundStation2 - direction
	Star5 - direction
	Star0 - direction
	Star4 - direction
	Phenomenon6 - direction
	Star7 - direction
	Star8 - direction
	Planet9 - direction
	Planet10 - direction
	Star11 - direction
	Phenomenon12 - direction
)
(:init
	(supports instrument0 image1)
	(supports instrument0 infrared3)
	(supports instrument0 thermograph0)
	(calibration_target instrument0 GroundStation2)
	(supports instrument1 infrared4)
	(supports instrument1 spectrograph2)
	(supports instrument1 image1)
	(calibration_target instrument1 GroundStation2)
	(calibration_target instrument1 Star0)
	(supports instrument2 image1)
	(supports instrument2 infrared4)
	(calibration_target instrument2 GroundStation2)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star5)
	(supports instrument3 spectrograph2)
	(supports instrument3 infrared3)
	(calibration_target instrument3 GroundStation3)
	(supports instrument4 image1)
	(supports instrument4 spectrograph2)
	(calibration_target instrument4 GroundStation2)
	(calibration_target instrument4 GroundStation3)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation3)
	(supports instrument5 image1)
	(supports instrument5 spectrograph2)
	(calibration_target instrument5 Star4)
	(calibration_target instrument5 GroundStation1)
	(supports instrument6 image1)
	(supports instrument6 thermograph0)
	(supports instrument6 infrared4)
	(calibration_target instrument6 GroundStation2)
	(supports instrument7 spectrograph2)
	(supports instrument7 infrared3)
	(calibration_target instrument7 Star4)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(on_board instrument7 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Planet10)
	(supports instrument8 infrared3)
	(calibration_target instrument8 GroundStation2)
	(on_board instrument8 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star0)
	(supports instrument9 infrared3)
	(supports instrument9 infrared4)
	(calibration_target instrument9 GroundStation1)
	(calibration_target instrument9 GroundStation3)
	(supports instrument10 spectrograph2)
	(supports instrument10 infrared4)
	(calibration_target instrument10 GroundStation1)
	(supports instrument11 thermograph0)
	(supports instrument11 spectrograph2)
	(calibration_target instrument11 Star0)
	(on_board instrument9 satellite4)
	(on_board instrument10 satellite4)
	(on_board instrument11 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Star7)
	(supports instrument12 spectrograph2)
	(calibration_target instrument12 Star5)
	(supports instrument13 image1)
	(calibration_target instrument13 GroundStation1)
	(on_board instrument12 satellite5)
	(on_board instrument13 satellite5)
	(power_avail satellite5)
	(pointing satellite5 Star8)
	(supports instrument14 image1)
	(supports instrument14 infrared3)
	(supports instrument14 spectrograph2)
	(calibration_target instrument14 GroundStation2)
	(supports instrument15 spectrograph2)
	(supports instrument15 infrared3)
	(supports instrument15 thermograph0)
	(calibration_target instrument15 Star5)
	(calibration_target instrument15 GroundStation2)
	(supports instrument16 image1)
	(calibration_target instrument16 Star4)
	(calibration_target instrument16 Star0)
	(on_board instrument14 satellite6)
	(on_board instrument15 satellite6)
	(on_board instrument16 satellite6)
	(power_avail satellite6)
	(pointing satellite6 GroundStation3)
)
(:goal (and
	(pointing satellite2 Phenomenon12)
	(pointing satellite5 Planet9)
	(pointing satellite6 Star4)
	(have_image Phenomenon6 infrared3)
	(have_image Star7 infrared4)
	(have_image Star8 spectrograph2)
	(have_image Planet9 spectrograph2)
	(have_image Planet10 infrared3)
	(have_image Star11 thermograph0)
	(have_image Phenomenon12 thermograph0)
))

)

; plan
1. (turn_to satellite6 star4 groundstation3)
   deleted: (pointing satellite6 groundstation3)
   added: (pointing satellite6 star4)
   goals met: 1 of 10
2. (turn_to satellite5 planet9 star8)
   deleted: (pointing satellite5 star8)
   added: (pointing satellite5 planet9)
   goals met: 2 of 10
3. (turn_to satellite2 groundstation2 planet10)
   deleted: (pointing satellite2 planet10)
   added: (pointing satellite2 groundstation2)
   goals met: 2 of 10
4. (switch_on instrument6 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument6)
   goals met: 2 of 10
5. (calibrate satellite2 instrument6 groundstation2)
   added: (calibrated instrument6)
   goals met: 2 of 10
6. (turn_to satellite2 star7 groundstation2)
   deleted: (pointing satellite2 groundstation2)
   added: (pointing satellite2 star7)
   goals met: 2 of 10
7. (take_image satellite2 star7 instrument6 infrared4)
   added: (have_image star7 infrared4)
   goals met: 3 of 10
8. (turn_to satellite2 star11 star7)
   deleted: (pointing satellite2 star7)
   added: (pointing satellite2 star11)
   goals met: 3 of 10
9. (take_image satellite2 star11 instrument6 thermograph0)
   added: (have_image star11 thermograph0)
   goals met: 4 of 10
10. (turn_to satellite2 phenomenon12 star11)
   deleted: (pointing satellite2 star11)
   added: (pointing satellite2 phenomenon12)
   goals met: 5 of 10
11. (take_image satellite2 phenomenon12 instrument6 thermograph0)
   added: (have_image phenomenon12 thermograph0)
   goals met: 6 of 10
12. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 6 of 10
13. (calibrate satellite1 instrument3 groundstation3)
   added: (calibrated instrument3)
   goals met: 6 of 10
14. (turn_to satellite1 phenomenon6 groundstation3)
   deleted: (pointing satellite1 groundstation3)
   added: (pointing satellite1 phenomenon6)
   goals met: 6 of 10
15. (take_image satellite1 phenomenon6 instrument3 infrared3)
   added: (have_image phenomenon6 infrared3)
   goals met: 7 of 10
16. (turn_to satellite1 planet10 phenomenon6)
   deleted: (pointing satellite1 phenomenon6)
   added: (pointing satellite1 planet10)
   goals met: 7 of 10
17. (take_image satellite1 planet10 instrument3 infrared3)
   added: (have_image planet10 infrared3)
   goals met: 8 of 10
18. (turn_to satellite1 planet9 planet10)
   deleted: (pointing satellite1 planet10)
   added: (pointing satellite1 planet9)
   goals met: 8 of 10
19. (take_image satellite1 planet9 instrument3 spectrograph2)
   added: (have_image planet9 spectrograph2)
   goals met: 9 of 10
20. (turn_to satellite1 star8 planet9)
   deleted: (pointing satellite1 planet9)
   added: (pointing satellite1 star8)
   goals met: 9 of 10
21. (take_image satellite1 star8 instrument3 spectrograph2)
   added: (have_image star8 spectrograph2)
   goals met: 10 of 10
